# Pandas

- Pandas is an open-source library that is made mainly for working with relational or labeled data both easily and intuitively. 
- It provides various data structures and operations for manipulating numerical data and time series. 
- This library is built on top of the NumPy library. 
- Pandas is fast and it has high performance & productivity for users.
- Pandas generally provide two data structures for manipulating data, They are: 
   - Series
   - DataFrame

In [1]:
#Importing necessary libraries

In [2]:
import pandas as pd

# Series
- Series is a one-dimensional labeled array and capable of holding data of any type (integer, string, float, python objects, etc.)

In [3]:
#Series creation.

In [4]:
#list method

In [5]:
lst = [10,52.0,True,'Python']
type(lst)

list

In [6]:
s = pd.Series(lst)
type(s)
s

0        10
1      52.0
2      True
3    Python
dtype: object

In [7]:
#Dictionary method

In [8]:
d = {'Name':'ABC','Age': 20,'Height' : 5.5}
pd.Series(d)

Name      ABC
Age        20
Height    5.5
dtype: object

In [9]:
#Series methods

In [10]:
s1 = pd.Series(data=['ABC','Python','ML'], index=['a','b','c'])
s1

a       ABC
b    Python
c        ML
dtype: object

In [11]:
#Accessing elements from a series using index labels.

In [12]:
s1[0]

'ABC'

In [13]:
s1['a']

'ABC'

# DataFrame
- A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns

In [14]:
df = pd.DataFrame({
    'Name' : ['ABC','XYZ','HDO'],
    'Subject name' : ['ML','Python','DL'],
    'Marks' : [85,95,85]
})

In [15]:
df

  Name Subject name  Marks
0  ABC           ML     85
1  XYZ       Python     95
2  HDO           DL     85

In [16]:
df.shape

(3, 3)

In [17]:
#Check number of rows and columns in dataframe

In [18]:
#Dimesion of the dataframe

In [19]:
df.ndim

2

In [20]:
#Data type of each column

In [21]:
df.dtypes

Name            object
Subject name    object
Marks            int64
dtype: object

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          3 non-null      object
 1   Subject name  3 non-null      object
 2   Marks         3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [23]:
#Extracting columns from dataframe

In [24]:
df.columns

Index(['Name', 'Subject name', 'Marks'], dtype='object')

In [25]:
df.Name

0    ABC
1    XYZ
2    HDO
Name: Name, dtype: object

In [26]:
df[['Name']]

  Name
0  ABC
1  XYZ
2  HDO

In [27]:
df.Subject name

SyntaxError: invalid syntax (2803984182.py, line 1)

In [28]:
df['Subject name']

0        ML
1    Python
2        DL
Name: Subject name, dtype: object

In [29]:
df[['Name','Marks']]

  Name  Marks
0  ABC     85
1  XYZ     95
2  HDO     85

# Importing External Dataset

In [30]:
#Load the csv file
pd.read_csv(r"C:\Users\Aishwarya\Desktop\ExcelR\Day 5-Python Intro\Salaries.csv")

         rank discipline  phd  service  gender  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [31]:
df = pd.read_csv('Salaries.csv')
df

         rank discipline  phd  service  gender  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [32]:
#Reading first 5 records

In [33]:
df.head()

   rank discipline  phd  service gender  salary
0  Prof          B   56       49   Male  186960
1  Prof          A   12        6   Male   93000
2  Prof          A   23       20   Male  110515
3  Prof          A   40       31   Male  131205
4  Prof          B   20       18   Male  104800

In [34]:
df.head(10)

        rank discipline  phd  service gender  salary
0       Prof          B   56       49   Male  186960
1       Prof          A   12        6   Male   93000
2       Prof          A   23       20   Male  110515
3       Prof          A   40       31   Male  131205
4       Prof          B   20       18   Male  104800
5       Prof          A   20       20   Male  122400
6  AssocProf          A   20       17   Male   81285
7       Prof          A   18       18   Male  126300
8       Prof          A   29       19   Male   94350
9       Prof          A   51       51   Male   57800

In [35]:
df.tail()

         rank discipline  phd  service  gender  salary
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [36]:
# pd.set_option('display.max_rows',None)

In [37]:
df

         rank discipline  phd  service  gender  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [38]:
#Reading all the records.

In [39]:
df1 = pd.read_csv('https://raw.githubusercontent.com/aishwaryamate/Datasets/main/Mobile_price_range.csv')
df1

,battery_power,blue,clock_speed,dual_sim,fc,four_g,int_memory,m_dep,mobile_wt,n_cores,...,px_height,px_width,ram,sc_h,sc_w,talk_time,three_g,touch_screen,wifi,price_range
0,842,0,2.2,0,1,0,7,0.6,188,2,...,20,756,2549,9,7,19,0,0,1,1
1,1021,1,0.5,1,0,1,53,0.7,136,3,...,905,1988,2631,17,3,7,1,1,0,2
2,563,1,0.5,1,2,1,41,0.9,145,5,...,1263,1716,2603,11,2,9,1,1,0,2
3,615,1,2.5,0,0,0,10,0.8,131,6,...,1216,1786,2769,16,8,11,1,0,0,2
4,1821,1,1.2,0,13,1,44,0.6,141,2,...,1208,1212,1411,8,2,15,1,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1995,794,1,0.5,1,0,1,2,0.8,106,6,...,1222,1890,668,13,4,19,1,1,0,0
1996,1965,1,2.6,1,0,0,39,0.2,187,4,...,915,1965,2032,11,10,16,1,1,1,2
1997,1911,0,0.9,1,1,1,36,0.7,108,8,...,868,1632,3057,9,1,5,1,1,0,3
1998,1512,0,0.9,0,4,1,46,0.1,145,5,...,336,670,869,18,10,19,1,1,1,0
1999,510,1,2.0,1,5,1,45,0.9,168,6,...,483,754,3919,19,4,2,1,1,1,3

In [40]:
pd.set_option('display.max_columns', None)

In [42]:
df1.head(2)

,battery_power,blue,clock_speed,dual_sim,fc,four_g,int_memory,m_dep,mobile_wt,n_cores,pc,px_height,px_width,ram,sc_h,sc_w,talk_time,three_g,touch_screen,wifi,price_range
0,842,0,2.2,0,1,0,7,0.6,188,2,2,20,756,2549,9,7,19,0,0,1,1
1,1021,1,0.5,1,0,1,53,0.7,136,3,6,905,1988,2631,17,3,7,1,1,0,2

In [ ]:
#Extracting only column names

In [43]:
df

         rank discipline  phd  service  gender  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [ ]:
#Selecting single and multiple columns

In [44]:
df[['rank','gender','salary']]

         rank  gender  salary
0        Prof    Male  186960
1        Prof    Male   93000
2        Prof    Male  110515
3        Prof    Male  131205
4        Prof    Male  104800
..        ...     ...     ...
73       Prof  Female  105450
74  AssocProf  Female  104542
75       Prof  Female  124312
76       Prof  Female  109954
77       Prof  Female  109646

[78 rows x 3 columns]

In [45]:
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [46]:
df.describe(include=object)

        rank discipline gender
count     78         78     78
unique     3          2      2
top     Prof          B   Male
freq      46         42     39

In [47]:
df.describe(include='all')

        rank discipline        phd    service gender         salary
count     78         78  78.000000  78.000000     78      78.000000
unique     3          2        NaN        NaN      2            NaN
top     Prof          B        NaN        NaN   Male            NaN
freq      46         42        NaN        NaN     39            NaN
mean     NaN        NaN  19.705128  15.051282    NaN  108023.782051
std      NaN        NaN  12.498425  12.139768    NaN   28293.661022
min      NaN        NaN   1.000000   0.000000    NaN   57800.000000
25%      NaN        NaN  10.250000   5.250000    NaN   88612.500000
50%      NaN        NaN  18.500000  14.500000    NaN  104671.000000
75%      NaN        NaN  27.750000  20.750000    NaN  126774.750000
max      NaN        NaN  56.000000  51.000000    NaN  186960.000000

In [ ]:
#Selecting columns with loc and iloc

In [ ]:
#loc function

In [48]:
df

         rank discipline  phd  service  gender  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [49]:
df.loc[5:25,'service':'salary']

    service gender  salary
5        20   Male  122400
6        17   Male   81285
7        18   Male  126300
8        19   Male   94350
9        51   Male   57800
10       33   Male  128250
11       23   Male  134778
12        0   Male   88000
13       33   Male  162200
14       19   Male  153750
15        3   Male  150480
16        3   Male   75044
17        0   Male   92000
18        7   Male  107300
19       27   Male  150500
20        4   Male   92000
21       30   Male  103106
22        2   Male   73000
23        0   Male   85000
24       23   Male   91100
25       31   Male   99418

In [52]:
df.iloc[5:26,3:6]

    service gender  salary
5        20   Male  122400
6        17   Male   81285
7        18   Male  126300
8        19   Male   94350
9        51   Male   57800
10       33   Male  128250
11       23   Male  134778
12        0   Male   88000
13       33   Male  162200
14       19   Male  153750
15        3   Male  150480
16        3   Male   75044
17        0   Male   92000
18        7   Male  107300
19       27   Male  150500
20        4   Male   92000
21       30   Male  103106
22        2   Male   73000
23        0   Male   85000
24       23   Male   91100
25       31   Male   99418

In [53]:
#Number of unique values

df['rank'].nunique()

3

In [ ]:
#Unique values in a column

In [54]:
df['rank'].unique()

array(['Prof', 'AssocProf', 'AsstProf'], dtype=object)

In [ ]:
#Value counts

In [56]:
df['rank'].value_counts()

Prof         46
AsstProf     19
AssocProf    13
Name: rank, dtype: int64

In [ ]:
#Renaming column names

In [57]:
df.head()

   rank discipline  phd  service gender  salary
0  Prof          B   56       49   Male  186960
1  Prof          A   12        6   Male   93000
2  Prof          A   23       20   Male  110515
3  Prof          A   40       31   Male  131205
4  Prof          B   20       18   Male  104800

In [58]:
df.rename(columns= {'rank':'RANK'})

         RANK discipline  phd  service  gender  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [59]:
df

         rank discipline  phd  service  gender  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [60]:
df.rename(columns={'rank':'RANK'}, inplace=True)

In [61]:
df

         RANK discipline  phd  service  gender  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]